import React from "react";
import { useNavigate } from "react-router";

const Question5 = () => {
  const navigate = useNavigate();

  return (
    <div className="min-h-screen bg-[#F5F9FF] px-4 py-8">
      <div className="max-w-2xl mx-auto">
        <button
          className="flex items-center text-[#183B56] text-base mb-6 gap-1 cursor-pointer"
          onClick={() => navigate(-1)}
        >
          
          <span className="bg-blue-500 px-5 py-3 text-white text-sm rounded-sm  ">← Back</span>
        </button>
        <h1 className="text-2xl md:text-3xl font-bold text-[#183B56] mb-6">
          আমার ব্যক্তিগত তথ্য কি নিরাপদ?
        </h1>
        <p className="text-[#183B56] mb-4">
          হ্যাঁ, আমরা আপনার ব্যক্তিগত তথ্য সুরক্ষিত রাখার জন্য যথাসাধ্য চেষ্টা করি। এআই ডার্মাটোলজিস্ট আপনার ব্যক্তিগত তথ্য তৃতীয় পক্ষের কাছে বিক্রি করেন না এবং আপনার তথ্য সুরক্ষিত রাখার জন্য সম্ভাব্য সকল ব্যবস্থা গ্রহণ করেন। সমস্ত ব্যক্তিগত তথ্য এবং তথ্য অনুমোদিত কর্মীদের দ্বারা গোপনীয়ভাবে ব্যবহার করা হয়।
        </p>
        <p className="text-[#183B56] mb-4">
          আপনার দ্বারা আমাদের প্রদত্ত সমস্ত ডেটা ইউরোপীয় ইউনিয়নের ভূখণ্ডে সুরক্ষিত ক্লাউড সার্ভারে সংরক্ষণ করা হয় অথবা EU-এর বাইরের বিশ্বস্ত বহিরাগত পরিষেবা প্রদানকারীদের দ্বারা সংরক্ষণ করা হয় যারা একই মান অনুযায়ী কাজ করে। বহিরাগত পরিষেবা প্রদানকারীরা আপনার ডেটা নিরাপদে এবং প্রযোজ্য আইন অনুসারে পরিচালনা করে তা নিশ্চিত করার জন্য আমরা যথাসাধ্য চেষ্টা করি।
         </p> 
        <p className="text-[#183B56]">
         অ্যাপ এবং/অথবা ওয়েবসাইটের মাধ্যমে আপনার সরবরাহ করা সমস্ত ডেটা ট্রান্সপোর্ট লেয়ার সিকিউরিটি ব্যবহার করে সার্ভারে এবং (TLS)থেকে স্থানান্তরিত হওয়ার সময় এনক্রিপ্ট করা হয়। তদুপরি, সার্ভারে সংরক্ষণ করা হলে ডেটা কোডেড আকারে সংরক্ষণ করা হয়।
        </p> 
        <p className="text-[#183B56]">
         আরও তথ্যের জন্য আমাদের গোপনীয়তা নীতি পড়ুন।
        </p>
      </div>
    </div>
  );
};

export default Question5;